"""표준 라이브러리 란?
특정한 프로그래밍 언어에서 자주 사용되는 표준 소스코드를 
미리 구현해 놓은 라이브러리를 의미한다.

파이썬 표준 라이브러리는 공식문서에서도 자세히 확인할 수 있다. 
추가로 필요한 기능이 있다면 공식문서를 활용하자.
@see https://docs.python.org/3/library/

코딩 테스트를 준비하며 반드시 알아야 하는 라이브러리는 6가지 정도이다.
각 라이브러리의 가장 중요하고 알아두어야 할 핵심만 먼저 살펴보자.

1. 내장함수 : 
    print(), input() 과 같은 기본 입출력 기능부터 
    sorted()와 같은 정렬기능을 포함하고 있는 기본 내장 라이브러리

2. itertools : 
    반복되는 형태의 데이터를 처리하는 기능을 제공하는 라이브러리
    순열과 조합 라이브러리를 제공

3. heapq : 
    힙(Heap)기능을 제공하는 라이브러리
    우선순위 큐 기능을 구현하기 위해 사용

4. bisect : 
    이진 탐색(Binary Search)기능을 제공하는 라이브러리

5. collections : 
    덱(deque), 카운터(Counter) 등의 유용한 자료구조를 포함하고 있는 라이브러리

6. math : 
    필수적인 수학적 기능을 제공하는 라이브러리이다.
    팩토리얼, 제곱근, 최대공약수(GCD), 삼각함수 관련 함수부터 
    파이(pi)와 같은 상수를 포함하고 있다.
"""
